# AreaCreationData Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AreaCreationData Properties
AreaCreationData Class See Also
---
The AreaCreationData type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| TagPoint | Specify the location of the area tag. |

# See Also
AreaCreationData Class
Autodesk.Revit.Creation Namespace